src/Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийПолный</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗаписьКлиента/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на документ РеализацияТоваровИУслуг созданный на основании документа ЗаписьКлиента.\
// Документ РеализацияТоваровИУслуг должен иметь статус: Проведен
//
// Параметры:
//	записьКлиентаСсылка - ДокументСсылка.ЗаписьКлиента
//
// Возвращаемое значение:
//	- ДокументСсылка.РеализацияТоваровИУслуг, Неопределено
//
Функция ПолучитьДокументРеализацииНаОсновании(Знач записьКлиентаСсылка) Экспорт
    Если НЕ ЗначениеЗаполнено(записьКлиентаСсылка) Тогда
        Возврат Неопределено;
    КонецЕсли;

    запросДокументаРеализации = Новый Запрос;
    запросДокументаРеализации.УстановитьПараметр("Ссылка", записьКлиентаСсылка);

    запросДокументаРеализации.Текст =
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |	РеализацияТоваровИУслуг.Ссылка КАК Ссылка
        |ИЗ
        |	Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
        |ГДЕ
        |	РеализацияТоваровИУслуг.ДокументОснование = &Ссылка
        |		И РеализацияТоваровИУслуг.Проведен
        |";

    результатЗапроса = запросДокументаРеализации.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    выборка = результатЗапроса.Выбрать();
    выборка.Следующий();

    Возврат выборка.Ссылка;

КонецФункции

// Параметры:
//  записьКлиентаСсылка - ДокументСсылка.ЗаказыКлиентов
// Возвращаемое значение:
//  - Булево
Функция ПолучитьУслугаОказана(Знач записьКлиентаСсылка) Экспорт
    Возврат ЗначениеЗаполнено(Документы.ЗаписьКлиента.ПолучитьДокументРеализацииНаОсновании(записьКлиентаСсылка));
КонецФункции

// Параметры:
//	списокНоменклатуры - ТаблицаЗначений, Массив
//	минимальноеВремяОказанияУслугиВМинутах - Число, Неопределено - Минимальная длительность приема клиента, в минутах
//
// Возвращаемое значение:
//	Число - Время оказания услуг, в минутах
//
Функция РассчитатьДлительностьОказанияУслуг(Знач списокНоменклатуры, Знач минимальноеВремяОказанияУслугиВМинутах = Неопределено) Экспорт

    Если минимальноеВремяОказанияУслугиВМинутах = Неопределено Тогда
        минимальноеВремяОказанияУслугиВМинутах = ПолучитьМинимальноеВремяОказанияУслугиВМинутах();
    КонецЕсли;

    Если НЕ (ЗначениеЗаполнено(списокНоменклатуры)
            ИЛИ проверитьЭтоДопустимоеЗначениеСпискаНоменклатуры(
                списокНоменклатуры, "Документы.ЗаписьКлиента.РассчитатьДатуОкончанияЗаписи")) Тогда
        Возврат минимальноеВремяОказанияУслугиВМинутах;
    КонецЕсли;

    Если ТипЗнч(списокНоменклатуры) = Тип("Массив") Тогда
        услугиТЗ = РаботаСКоллекциями.КонвертироватьМассивВТаблицуЗначений(списокНоменклатуры, "Услуга",
                Тип("СправочникСсылка.Номенклатура"));
    Иначе
        услугиТЗ = списокНоменклатуры;
    КонецЕсли;

    запрос = Новый Запрос;
    запрос.УстановитьПараметр("УслугиТЗ", услугиТЗ);

    запрос.Текст =
        "ВЫБРАТЬ
        |	УслугиТЗ.Услуга КАК Номенклатура
        |ПОМЕСТИТЬ ВТ_Услуги
        |ИЗ
        |	&УслугиТЗ КАК УслугиТЗ
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |	СУММА(НоменклатураТиУ.ДлительностьУслуги) КАК ДлительностьУслуги
        |ИЗ
        |	ВТ_Услуги КАК ВТ_Услуги
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураТиУ
        |		ПО ВТ_Услуги.Номенклатура = НоменклатураТиУ.Ссылка
        |";

    результат = запрос.Выполнить();
    Если результат.Пустой() Тогда
        Возврат минимальноеВремяОказанияУслугиВМинутах;
    КонецЕсли;

    выборка = запрос.Выполнить().Выбрать();
    выборка.Следующий();
    Возврат Макс(выборка.ДлительностьУслуги, минимальноеВремяОказанияУслугиВМинутах);
КонецФункции

// Возвращаемое значение:
//	- Число - Минимальная длительность приема клиента, в минутах
Функция ПолучитьМинимальноеВремяОказанияУслугиВМинутах() Экспорт
    Возврат 60;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Если проверка не пройдена - вызывает исключение
//
// Параметры:
//	списокНоменклатуры - ТаблицаЗначений, Массив
//	контекстДиагностики - Строка
//
// Возвращаемое значение:
//	Булево
Функция проверитьЭтоДопустимоеЗначениеСпискаНоменклатуры(Знач списокНоменклатуры, контекстДиагностики = Неопределено)
    контекстДиагностики = ?(ЗначениеЗаполнено(контекстДиагностики),
            контекстДиагностики, "Документы.ЗаписьКлиента.проверитьЭтоДопустимоеЗначениеСпискаНоменклатуры");
    имяАргументаДиагностики = "СписокНоменклатуры";
    имяКолонкиНоменклатура = "Номенклатура";
    типЗнчСпискаНоменклатуры = ТипЗнч(списокНоменклатуры);

    этоДопустимыйТипСпискаНоменклатуры = типЗнчСпискаНоменклатуры = Тип("ТаблицаЗначений")
        ИЛИ типЗнчСпискаНоменклатуры = Тип("Массив");

    ДиагностикаКлиентСервер.Утверждение(списокНоменклатуры <> Неопределено,
        СтрШаблон("Аргумент ""%1"" не может иметь значение ""Неопределено""",
            имяАргументаДиагностики),
        контекстДиагностики);

    ДиагностикаКлиентСервер.Утверждение(этоДопустимыйТипСпискаНоменклатуры,
        СтрШаблон("Аргумент ""%1"" имеет недопустимый тип ""%2"" значения",
            имяАргументаДиагностики, имяКолонкиНоменклатура),
        контекстДиагностики);

    ДиагностикаКлиентСервер.Утверждение(типЗнчСпискаНоменклатуры <> Тип("ТаблицаЗначений")
        ИЛИ списокНоменклатуры.Колонки.Найти(имяКолонкиНоменклатура) <> Неопределено,
        СтрШаблон("Аргумент ""%1"" типа ""ТаблицаЗначений"" и должен иметь колонку ""%2""",
            имяАргументаДиагностики, имяКолонкиНоменклатура),
        контекстДиагностики);

    Возврат Истина;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
